ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DB64def.inc
.equ SLPCTRL_CTRLA = 0x0050              ; Control A
.equ SLPCTRL_VREGCTRL = 0x0051           ; Control B

;*************************************************************************
;** SPI0 - Serial Peripheral Interface
;*************************************************************************

.equ SPI0_CTRLA = 0x0940                 ; Control A
.equ SPI0_CTRLB = 0x0941                 ; Control B
.equ SPI0_INTCTRL = 0x0942               ; Interrupt Control
.equ SPI0_INTFLAGS = 0x0943              ; Interrupt Flags
.equ SPI0_DATA = 0x0944                  ; Data

;*************************************************************************
;** SPI1 - Serial Peripheral Interface
;*************************************************************************

.equ SPI1_CTRLA = 0x0960                 ; Control A
.equ SPI1_CTRLB = 0x0961                 ; Control B
.equ SPI1_INTCTRL = 0x0962               ; Interrupt Control
.equ SPI1_INTFLAGS = 0x0963              ; Interrupt Flags
.equ SPI1_DATA = 0x0964                  ; Data

;*************************************************************************
;** SYSCFG - System Configuration Registers
;*************************************************************************

.equ SYSCFG_REVID = 0x0F01               ; Revision ID
.equ SYSCFG_OCDMCTRL = 0x0F18            ; OCD Message Control
.equ SYSCFG_OCDMSTATUS = 0x0F19          ; OCD Message Status

;*************************************************************************
;** TCA0 - 16-bit Timer/Counter Type A
;*************************************************************************

.equ TCA0_SINGLE_CTRLA = 0x0A00          ; SINGLE Control A
.equ TCA0_SPLIT_CTRLA = 0x0A00           ; SPLIT Control A
.equ TCA0_SINGLE_CTRLB = 0x0A01          ; SINGLE Control B
.equ TCA0_SPLIT_CTRLB = 0x0A01           ; SPLIT Control B
.equ TCA0_SINGLE_CTRLC = 0x0A02          ; SINGLE Control C
.equ TCA0_SPLIT_CTRLC = 0x0A02           ; SPLIT Control C
.equ TCA0_SINGLE_CTRLD = 0x0A03          ; SINGLE Control D
.equ TCA0_SPLIT_CTRLD = 0x0A03           ; SPLIT Control D
.equ TCA0_SINGLE_CTRLECLR = 0x0A04       ; SINGLE Control E Clear
.equ TCA0_SPLIT_CTRLECLR = 0x0A04        ; SPLIT Control E Clear
.equ TCA0_SINGLE_CTRLESET = 0x0A05       ; SINGLE Control E Set
.equ TCA0_SPLIT_CTRLESET = 0x0A05        ; SPLIT Control E Set
.equ TCA0_SINGLE_CTRLFCLR = 0x0A06       ; SINGLE Control F Clear
.equ TCA0_SINGLE_CTRLFSET = 0x0A07       ; SINGLE Control F Set
.equ TCA0_SINGLE_EVCTRL = 0x0A09         ; SINGLE Event Control
.equ TCA0_SINGLE_INTCTRL = 0x0A0A        ; SINGLE Interrupt Control
.equ TCA0_SPLIT_INTCTRL = 0x0A0A         ; SPLIT Interrupt Control
.equ TCA0_SINGLE_INTFLAGS = 0x0A0B       ; SINGLE Interrupt Flags
.equ TCA0_SPLIT_INTFLAGS = 0x0A0B        ; SPLIT Interrupt Flags
.equ TCA0_SINGLE_DBGCTRL = 0x0A0E        ; SINGLE Debug Control
.equ TCA0_SPLIT_DBGCTRL = 0x0A0E         ; SPLIT Debug Control
.equ TCA0_SINGLE_TEMP = 0x0A0F           ; SINGLE Temporary data for 16-bit Access
.equ TCA0_SINGLE_CNT = 0x0A20            ; SINGLE Count
.equ TCA0_SINGLE_CNTL = 0x0A20           ; SINGLE Count low byte
.equ TCA0_SINGLE_CNTH = 0x0A21           ; SINGLE Count hi byte
.equ TCA0_SPLIT_LCNT = 0x0A20            ; SPLIT Low Count
.equ TCA0_SPLIT_HCNT = 0x0A21            ; SPLIT High Count
.equ TCA0_SINGLE_PER = 0x0A26            ; SINGLE Period
.equ TCA0_SINGLE_PERL = 0x0A26           ; SINGLE Period low byte
.equ TCA0_SINGLE_PERH = 0x0A27           ; SINGLE Period hi byte
.equ TCA0_SPLIT_LPER = 0x0A26            ; SPLIT Low Period
.equ TCA0_SPLIT_HPER = 0x0A27            ; SPLIT High Period
.equ TCA0_SINGLE_CMP0 = 0x0A28           ; SINGLE Compare 0
.equ TCA0_SINGLE_CMP0L = 0x0A28          ; SINGLE Compare 0 low byte
.equ TCA0_SINGLE_CMP0H = 0x0A29          ; SINGLE Compare 0 hi byte
.equ TCA0_SPLIT_LCMP0 = 0x0A28           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP0 = 0x0A29           ; SPLIT High Compare
.equ TCA0_SINGLE_CMP1 = 0x0A2A           ; SINGLE Compare 1
.equ TCA0_SINGLE_CMP1L = 0x0A2A          ; SINGLE Compare 1 low byte
.equ TCA0_SINGLE_CMP1H = 0x0A2B          ; SINGLE Compare 1 hi byte
.equ TCA0_SPLIT_LCMP1 = 0x0A2A           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP1 = 0x0A2B           ; SPLIT High Compare
.equ TCA0_SINGLE_CMP2 = 0x0A2C           ; SINGLE Compare 2
.equ TCA0_SINGLE_CMP2L = 0x0A2C          ; SINGLE Compare 2 low byte
.equ TCA0_SINGLE_CMP2H = 0x0A2D          ; SINGLE Compare 2 hi byte
.equ TCA0_SPLIT_LCMP2 = 0x0A2C           ; SPLIT Low Compare
.equ TCA0_SPLIT_HCMP2 = 0x0A2D           ; SPLIT High Compare
.equ TCA0_SINGLE_PERBUF = 0x0A36         ; SINGLE Period Buffer
.equ TCA0_SINGLE_PERBUFL = 0x0A36        ; SINGLE Period Buffer low byte
.equ TCA0_SINGLE_PERBUFH = 0x0A37        ; SINGLE Period Buffer hi byte
.equ TCA0_SINGLE_CMP0BUF = 0x0A38        ; SINGLE Compare 0 Buffer
.equ TCA0_SINGLE_CMP0BUFL = 0x0A38       ; SINGLE Compare 0 Buffer low byte
.equ TCA0_SINGLE_CMP0BUFH = 0x0A39       ; SINGLE Compare 0 Buffer hi byte
.equ TCA0_SINGLE_CMP1BUF = 0x0A3A        ; SINGLE Compare 1 Buffer
.equ TCA0_SINGLE_CMP1BUFL = 0x0A3A       ; SINGLE Compare 1 Buffer low byte
.equ TCA0_SINGLE_CMP1BUFH = 0x0A3B       ; SINGLE Compare 1 Buffer hi byte
.equ TCA0_SINGLE_CMP2BUF = 0x0A3C        ; SINGLE Compare 2 Buffer
.equ TCA0_SINGLE_CMP2BUFL = 0x0A3C       ; SINGLE Compare 2 Buffer low byte
.equ TCA0_SINGLE_CMP2BUFH = 0x0A3D       ; SINGLE Compare 2 Buffer hi byte

;*************************************************************************
;** TCA1 - 16-bit Timer/Counter Type A
;*************************************************************************

.equ TCA1_SINGLE_CTRLA = 0x0A40          ; SINGLE Control A
.equ TCA1_SPLIT_CTRLA = 0x0A40           ; SPLIT Control A
.equ TCA1_SINGLE_CTRLB = 0x0A41          ; SINGLE Control B
.equ TCA1_SPLIT_CTRLB = 0x0A41           ; SPLIT Control B
.equ TCA1_SINGLE_CTRLC = 0x0A42          ; SINGLE Control C
.equ TCA1_SPLIT_CTRLC = 0x0A42           ; SPLIT Control C
.equ TCA1_SINGLE_CTRLD = 0x0A43          ; SINGLE Control D
.equ TCA1_SPLIT_CTRLD = 0x0A43           ; SPLIT Control D
.equ TCA1_SINGLE_CTRLECLR = 0x0A44       ; SINGLE Control E Clear
.equ TCA1_SPLIT_CTRLECLR = 0x0A44        ; SPLIT Control E Clear
.equ TCA1_SINGLE_CTRLESET = 0x0A45       ; SINGLE Control E Set
.equ TCA1_SPLIT_CTRLESET = 0x0A45        ; SPLIT Control E Set
.equ TCA1_SINGLE_CTRLFCLR = 0x0A46       ; SINGLE Control F Clear
.equ TCA1_SINGLE_CTRLFSET = 0x0A47       ; SINGLE Control F Set
.equ TCA1_SINGLE_EVCTRL = 0x0A49         ; SINGLE Event Control
.equ TCA1_SINGLE_INTCTRL = 0x0A4A        ; SINGLE Interrupt Control
.equ TCA1_SPLIT_INTCTRL = 0x0A4A         ; SPLIT Interrupt Control
.equ TCA1_SINGLE_INTFLAGS = 0x0A4B       ; SINGLE Interrupt Flags
.equ TCA1_SPLIT_INTFLAGS = 0x0A4B        ; SPLIT Interrupt Flags
.equ TCA1_SINGLE_DBGCTRL = 0x0A4E        ; SINGLE Debug Control
.equ TCA1_SPLIT_DBGCTRL = 0x0A4E         ; SPLIT Debug Control
.equ TCA1_SINGLE_TEMP = 0x0A4F           ; SINGLE Temporary data for 16-bit Access
.equ TCA1_SINGLE_CNT = 0x0A60            ; SINGLE Count
.equ TCA1_SINGLE_CNTL = 0x0A60           ; SINGLE Count low byte
.equ TCA1_SINGLE_CNTH = 0x0A61           ; SINGLE Count hi byte
.equ TCA1_SPLIT_LCNT = 0x0A60            ; SPLIT Low Count
.equ TCA1_SPLIT_HCNT = 0x0A61            ; SPLIT High Count
.equ TCA1_SINGLE_PER = 0x0A66            ; SINGLE Period
.equ TCA1_SINGLE_PERL = 0x0A66           ; SINGLE Period low byte
.equ TCA1_SINGLE_PERH = 0x0A67           ; SINGLE Period hi byte
.equ TCA1_SPLIT_LPER = 0x0A66            ; SPLIT Low Period
.equ TCA1_SPLIT_HPER = 0x0A67            ; SPLIT High Period
.equ TCA1_SINGLE_CMP0 = 0x0A68           ; SINGLE Compare 0
.equ TCA1_SINGLE_CMP0L = 0x0A68          ; SINGLE Compare 0 low byte
.equ TCA1_SINGLE_CMP0H = 0x0A69          ; SINGLE Compare 0 hi byte
.equ TCA1_SPLIT_LCMP0 = 0x0A68           ; SPLIT Low Compare
.equ TCA1_SPLIT_HCMP0 = 0x0A69           ; SPLIT High Compare
.equ TCA1_SINGLE_CMP1 = 0x0A6A           ; SINGLE Compare 1
.equ TCA1_SINGLE_CMP1L = 0x0A6A          ; SINGLE Compare 1 low byte
.equ TCA1_SINGLE_CMP1H = 0x0A6B          ; SINGLE Compare 1 hi byte
.equ TCA1_SPLIT_LCMP1 = 0x0A6A           ; SPLIT Low Compare
.equ TCA1_SPLIT_HCMP1 = 0x0A6B           ; SPLIT High Compare
.equ TCA1_SINGLE_CMP2 = 0x0A6C           ; SINGLE Compare 2
.equ TCA1_SINGLE_CMP2L = 0x0A6C          ; SINGLE Compare 2 low byte
.equ TCA1_SINGLE_CMP2H = 0x0A6D          ; SINGLE Compare 2 hi byte
.equ TCA1_SPLIT_LCMP2 = 0x0A6C           ; SPLIT Low Compare
.equ TCA1_SPLIT_HCMP2 = 0x0A6D           ; SPLIT High Compare
.equ TCA1_SINGLE_PERBUF = 0x0A76         ; SINGLE Period Buffer
.equ TCA1_SINGLE_PERBUFL = 0x0A76        ; SINGLE Period Buffer low byte
.equ TCA1_SINGLE_PERBUFH = 0x0A77        ; SINGLE Period Buffer hi byte
.equ TCA1_SINGLE_CMP0BUF = 0x0A78        ; SINGLE Compare 0 Buffer
.equ TCA1_SINGLE_CMP0BUFL = 0x0A78       ; SINGLE Compare 0 Buffer low byte
.equ TCA1_SINGLE_CMP0BUFH = 0x0A79       ; SINGLE Compare 0 Buffer hi byte
.equ TCA1_SINGLE_CMP1BUF = 0x0A7A        ; SINGLE Compare 1 Buffer
.equ TCA1_SINGLE_CMP1BUFL = 0x0A7A       ; SINGLE Compare 1 Buffer low byte
.equ TCA1_SINGLE_CMP1BUFH = 0x0A7B       ; SINGLE Compare 1 Buffer hi byte
.equ TCA1_SINGLE_CMP2BUF = 0x0A7C        ; SINGLE Compare 2 Buffer
.equ TCA1_SINGLE_CMP2BUFL = 0x0A7C       ; SINGLE Compare 2 Buffer low byte
.equ TCA1_SINGLE_CMP2BUFH = 0x0A7D       ; SINGLE Compare 2 Buffer hi byte

;*************************************************************************
;** TCB0 - 16-bit Timer Type B
;*************************************************************************

